In [2]:
#THIS IS MY SQL CHEATSHEET
#suppoose we are using the followuing table as thne reference table, then the following outputs can be obtained. 


import pandas as pd
df=pd.read_csv('sql.csv')
df

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100  2.034300e+10
1      Albania    Europe    28748     2831741  1.296000e+10
2      Algeria    Africa  2381741    37100000  1.886810e+11
3      Andorra    Europe      468       78115  3.712000e+09
4       Angola    Africa  1246700    20609294  1.009900e+11

In [ ]:
#USING THE WHERE CLAUSE 
#The example uses a WHERE clause to show the population of 'France'. Note that strings (pieces of text that are data) should be in 'single quotes';

SELECT population FROM world
  WHERE name = 'Albania'

In [ ]:
USING THE 'IN'CLAUSE
#Checking a list The word IN allows us to check if an item is in a list. The example shows the name and population for the countries 'Brazil', 'Russia', 'India' and 'China'.

#Show the name and the population for 'Brazil', 'Russia', 'India' and 'China.

SELECT name, population FROM world
  WHERE name IN ('Brazil', 'Russia', 'India', 'China');

In [ ]:
USING 'BETWEEN' CLAUSE

#BETWEEN allows range checking (range specified is inclusive of boundary values). 
#The example below shows countries with an area of 250,000-300,000 sq.Km

SELECT name, area FROM world
  WHERE area BETWEEN 250000 AND 300000

In [ ]:
USING 'LIKE' CLAUSE

#The SQL Like is a logical operator that is used to determine whether a specific character string matches a specified pattern
#Example

 
SELECT name FROM world
 WHERE name LIKE '%a' OR name LIKE 'l%'  #the follwing command checks for names ending with 'a' or 'l'
    
SELECT name, population
      FROM world
      WHERE name LIKE "Al%"   #then follwing command checks for names that start with 'AL'

In [ ]:
USING 'EQUALS, LESS THAN, GREATER THAN' COMMANDS 
Consider the follwing commands

SELECT name, area, population
FROM world
WHERE area > 50000 AND population < 10000000 

SELECT name, area, population
FROM world
WHERE area = 50000 AND population = 10000000 #it only has one equals sign. 


SELECT name, area, population
FROM world
WHERE area >= 50000 AND population <= 10000000 # the greater or less than commanmd comes before the equals sign ('>=' and '<=')

In [ ]:
USING Exclusive OR '(XOR)'
#When we use th OR clause it will return A AND/OR B, but the XOR clause only returns A or B and not both. 

Consider the following example:    
#Exclusive OR (XOR). Show the countries that are big by area (more than 3 million) or big by population (more than 250 million) but not both. Show name, population and area.
#Australia has a big area but a small population, it should be included.
#Indonesia has a big population but a small area, it should be included.
#China has a big population and big area, it should be excluded.
#United Kingdom has a small population and a small area, it should be excluded.


SELECT name, population, area FROM world
WHERE area > 3000000 XOR population >250000000

In [ ]:

Rounding

#Show the name and population in millions and the GDP in billions for the countries of the continent 'South America'. Use the ROUND function to show the values to two decimal places.

#For South America show population in millions and GDP in billions both to 2 decimal places.
#Millions and billions
#Divide by 1000000 (6 zeros) for millions. Divide by 1000000000 (9 zeros) for billions.

SELECT name, ROUND(population/1000000, 2), ROUND(gdp/1000000000, 2) FROM world
WHERE continent = 'South America'

In [ ]:
Trillion dollar economies (ROUNDING UP) FOR INSTANCE, ROUNDING UP TO THE NEAREST 1000 (add a '-' before the rounding value)
#Consider the following example. 
#Show the name and per-capita GDP for those countries with a GDP of at least one trillion (1000000000000; that is 12 zeros). Round this value to the nearest 1000. 
#Show per-capita GDP for the trillion dollar countries to the nearest $1000.

SELECT name, ROUND(gdp/population, -3) FROM world 
WHERE gdp > 1000000000000

In [ ]:
#USING THE NOT LIKE COMMAND
CONSIDER THE FOLLWING EXAMPLE
#Equatorial Guinea and Dominican Republic have all of the vowels (a e i o u) in the name. They don't count because they have more than one word in the name.
#Find the country that has all the vowels and no spaces in its name.

#You can use the phrase name NOT LIKE '%a%' to exclude characters from your results.
#The query shown misses countries like Bahamas and Belarus because they contain at least one 'a'


SELECT name FROM world
WHERE name LIKE '%a%' AND name LIKE '%e%' AND name LIKE '%i%' AND name LIKE '%o%' AND name LIKE '%u%' AND name NOT LIKE '% %';